{"modelTopology": {"model_config": {"config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_1", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "name": "conv2d_1", "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 16, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "config": {"name": "leaky_re_lu_1", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "name": "conv2d_2", "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "config": {"name": "leaky_re_lu_2", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "name": "conv2d_3", "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "config": {"name": "leaky_re_lu_3", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "name": "conv2d_4", "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "config": {"name": "leaky_re_lu_4", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "conv2d_5", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "name": "conv2d_5", "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "config": {"name": "leaky_re_lu_5", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_5", "pool_size": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "conv2d_6", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "name": "conv2d_6", "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "config": {"name": "leaky_re_lu_6", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_7", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "name": "conv2d_7", "dilation_rate": [1, 1], "padding": "same", "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 30, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}], "output_layers": [["conv2d_7", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}, "backend": "tensorflow", "keras_version": "2.2.4"}, "weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 3, 16]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [16]}, {"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 16, 32]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [32]}, {"name": "conv2d_3/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_3/bias", "dtype": "float32", "shape": [64]}, {"name": "conv2d_4/kernel", "dtype": "float32", "shape": [3, 3, 64, 128]}, {"name": "conv2d_4/bias", "dtype": "float32", "shape": [128]}, {"name": "conv2d_5/kernel", "dtype": "float32", "shape": [3, 3, 128, 128]}, {"name": "conv2d_5/bias", "dtype": "float32", "shape": [128]}, {"name": "conv2d_6/kernel", "dtype": "float32", "shape": [3, 3, 128, 256]}, {"name": "conv2d_6/bias", "dtype": "float32", "shape": [256]}, {"name": "conv2d_7/kernel", "dtype": "float32", "shape": [1, 1, 256, 30]}, {"name": "conv2d_7/bias", "dtype": "float32", "shape": [30]}], "paths": ["group1-shard1of1"]}]}